# 1. Importing libraries and loading dataset

In [1]:
#Import libraries
import pandas as pd
import numpy as np
import os

In [16]:
#Importing the products.csv worksheet
path = r'C:\Users\marig\OneDrive\Área de Trabalho\curso arbeitsamt\data immersion\achievement 4\07.2023.Instacart Basket Analysis\Data'

In [17]:
df_prods = pd.read_csv (os.path.join (path, 'Original Data', '4.3_orders_products','products.csv'), index_col = False)

In [20]:
df_ords = pd.read_csv (os.path.join (path, 'Prepared Data', 'orders_wrangled.csv'), index_col = False)

In [21]:
df_ords.head()

,order_id,user_id,order_number,orders_day_of_week,order_hour_of_day,days_since_prior_order
0,2539329,1,1,2,8,NaN
1,2398795,1,2,3,7,15.0
2,473747,1,3,3,12,21.0
3,2254736,1,4,4,7,29.0
4,431534,1,5,4,15,28.0

In [23]:
#changing variables that are not necessary for descriptive analysis to string
df_ords ['order_id']=df_ords['order_id'].astype('string')

In [24]:
df_ords ['user_id']=df_ords['user_id'].astype('string')

In [25]:
df_ords ['order_number']=df_ords['order_number'].astype('string')

In [26]:
#Descriptive Analysis
df_ords.describe()

       orders_day_of_week  order_hour_of_day  days_since_prior_order
count        3.421083e+06       3.421083e+06            3.214874e+06
mean         2.776219e+00       1.345202e+01            1.111484e+01
std          2.046829e+00       4.226088e+00            9.206737e+00
min          0.000000e+00       0.000000e+00            0.000000e+00
25%          1.000000e+00       1.000000e+01            4.000000e+00
50%          3.000000e+00       1.300000e+01            7.000000e+00
75%          5.000000e+00       1.600000e+01            1.500000e+01
max          6.000000e+00       2.300000e+01            3.000000e+01

# 2. Finding mixed data types
## Creating a test dataframe

In [29]:
df_test =pd.DataFrame ()

In [30]:
# creating a mixed type column
df_test ['mix'] = ['a', 'b', 1, True]

In [31]:
df_test.head()

    mix
0     a
1     b
2     1
3  True

In [32]:
# Check for mixed types

for col in df_test.columns.tolist():
  weird = (df_test[[col]].applymap(type) != df_test[[col]].iloc[0].apply(type)).any(axis = 1)
  if len (df_test[weird]) > 0:
    print (col)

mix

In [33]:
# Fixing the data types:
df_test['mix'] = df_test['mix'].astype('str')

# 3. Missing values

In [34]:
# Finding missing values
df_prods.isnull().sum()

product_id        0
product_name     16
aisle_id          0
department_id     0
prices            0
dtype: int64

In [35]:
# there are 16 missing values on column product_name!

In [36]:
#creating a new df to show where are the missing values
df_nan = df_prods [df_prods ['product_name'].isnull() == True]

In [37]:
df_nan

       product_id product_name  aisle_id  department_id  prices
33             34          NaN       121             14    12.2
68             69          NaN        26              7    11.8
115           116          NaN        93              3    10.8
261           262          NaN       110             13    12.1
525           525          NaN       109             11     1.2
1511         1511          NaN        84             16    14.3
1780         1780          NaN       126             11    12.3
2240         2240          NaN        52              1    14.2
2586         2586          NaN       104             13    12.4
3159         3159          NaN       126             11    13.1
3230         3230          NaN       120             16    14.4
3736         3736          NaN        41              8    14.8
4283         4283          NaN        77              7    14.4
4790         4790          NaN        91             16    14.5
38187       38183          NaN        39             12    20.9
40444       40440          NaN       120             16    14.8

## 3.1 Addressing missing values

In [38]:
# Methods : a)Create a new variable that acts like a flag based on the missing value.
            #b)Impute the value with the mean or median of the column (if the variable is numeric).
            #c)Remove or filter out the missing data.
        
        # b) for mean: df['column with missings'].fillna(mean value, inplace=True)
        #    for median: df['column with missings'].fillna(median value, inplace=True)

In [ ]:
# Before removing the missing values

In [41]:
df_prods.shape

(49693, 5)

In [42]:
# creating a new df
df_prods_clean = df_prods [df_prods ['product_name'].isnull () == False]

In [43]:
df_prods_clean.shape

(49677, 5)

In [ ]:
# another code to do that overwriting the df:

# --> df_prods.dropna(inplace = True)

# for only a particular column:
# df_prods.dropna(subset = [‘product_name’], inplace = True)

# 4. Duplicates

In [44]:
# Finding duplicates
df_dups = df_prods_clean[df_prods_clean.duplicated()]

In [45]:
# displaying all the duplicated rows with df.
df_dups

,product_id,product_name,aisle_id,department_id,prices
462,462,Fiber 4g Gummy Dietary Supplement,70,11,4.8
18459,18458,Ranger IPA,27,5,9.2
26810,26808,Black House Coffee Roasty Stout Beer,27,5,13.4
35309,35306,Gluten Free Organic Peanut Butter & Chocolate ...,121,14,6.8
35495,35491,Adore Forever Body Wash,127,11,9.9

In [48]:
# Addressing duplicates - Cleaning it
df_prods_clean.shape

(49677, 5)

In [49]:
df_prods_clean_no_dups = df_prods_clean.drop_duplicates()

In [50]:
df_prods_clean_no_dups.shape

(49672, 5)

# 5. Tidying Up and Exporting Changes

In [53]:
df_prods_clean_no_dups.to_csv(os.path.join(path, 'Prepared Data', 'products_checked.csv'), index = False)

# Exercise 4.5

In [54]:
#2. Run the df.describe() function on your df_ords
df_ords.describe()

       orders_day_of_week  order_hour_of_day  days_since_prior_order
count        3.421083e+06       3.421083e+06            3.214874e+06
mean         2.776219e+00       1.345202e+01            1.111484e+01
std          2.046829e+00       4.226088e+00            9.206737e+00
min          0.000000e+00       0.000000e+00            0.000000e+00
25%          1.000000e+00       1.000000e+01            4.000000e+00
50%          3.000000e+00       1.300000e+01            7.000000e+00
75%          5.000000e+00       1.600000e+01            1.500000e+01
max          6.000000e+00       2.300000e+01            3.000000e+01

In [55]:
#Answer: I think the min and max values are strange, because they are too big. We are looking for data abou how many days of a week
# or hours, those big numbers don't make sence.

In [ ]:
#3 and 4. Check for mixed-type data in your df_ords dataframe.If found, fix it.

In [58]:
for col in df_ords.columns.tolist():
  weird = (df_ords[[col]].applymap(type) != df_ords[[col]].iloc[0].apply(type)).any(axis = 1)
  if len (df_ords[weird]) > 0:
    print (col)

In [59]:
# Answer: I did not find any mixed values.

In [60]:
#5. Run a check for missing values in your df_ords dataframe.
df_ords.isnull().sum()

order_id                       0
user_id                        0
order_number                   0
orders_day_of_week             0
order_hour_of_day              0
days_since_prior_order    206209
dtype: int64

In [61]:
#Answer: There are 206209 missing values on column Days since prior order. Maybe it is difficult for the company to
#determine the days before the prior order on instacart.

In [62]:
#6. Address the missing values using an appropriate method.
#creating a new df to show where are the missing values
df_ords_nan = df_ords [df_ords ['days_since_prior_order'].isnull() == True]

In [63]:
df_ords_nan

,order_id,user_id,order_number,orders_day_of_week,order_hour_of_day,days_since_prior_order
0,2539329,1,1,2,8,NaN
11,2168274,2,1,2,11,NaN
26,1374495,3,1,1,14,NaN
39,3343014,4,1,6,11,NaN
45,2717275,5,1,3,12,NaN
...,...,...,...,...,...,...
3420930,969311,206205,1,4,12,NaN
3420934,3189322,206206,1,3,18,NaN
3421002,2166133,206207,1,6,19,NaN
3421019,2227043,206208,1,1,15,NaN
3421069,3154581,206209,1,3,11,NaN

In [65]:
df_ords.shape

(3421083, 6)

In [66]:
# creating a new df and removing the missing values.
df_ords_clean = df_ords [df_ords ['days_since_prior_order'].isnull () == False]

In [67]:
df_ords_clean.shape

(3214874, 6)

In [68]:
# I decided to exclude all the missing values because there is a big number and it could lead to mistakes in my final analysis.
# If there was real life, I would first ask the company more about this variable days since prior order, because I did not
# understand what it means and I would like to have more information to know why there are so many missing data.

In [70]:
#7. Run a check for duplicate values in your df_ords data.
# Finding duplicates
df_dups_2 = df_ords_clean[df_ords_clean.duplicated()]

In [71]:
# displaying all the duplicated rows with df.
df_dups_2

Empty DataFrame
Columns: [order_id, user_id, order_number, orders_day_of_week, order_hour_of_day, days_since_prior_order]
Index: []

In [72]:
#Answer: There were no duplicates found.

In [73]:
#8. Address the duplicates using an appropriate method
#Answer: I did not found any duplicates in this dataframe.

In [75]:
#9. Exporting the final archive for orders.csv
df_ords_clean.to_csv(os.path.join(path, 'Prepared Data', 'orders_checked.csv'), index = False)